In [1]:
from pandas import DataFrame

In [2]:
data = {
    "class" : ["A1", "A1", "A1", "A1", "A1",
               "A2", "A2", "A2", "A2", "A2", "A2",
               "A3", "A3", "A3", "A3", "A3", "A3", "A3",
               "A4", "A4", "A4", "A4", "A4", "A4", "A4"],
    "time"  : [62, 60, 63, 59, 61,
               62, 67, 71, 64, 65, 66,
               68, 66, 71, 67, 68, 69, 70,
               58, 62, 60, 59, 61, 63, 64]
}

df = DataFrame(data)
df

   class  time
0     A1    62
1     A1    60
2     A1    63
3     A1    59
4     A1    61
5     A2    62
6     A2    67
7     A2    71
8     A2    64
9     A2    65
10    A2    66
11    A3    68
12    A3    66
13    A3    71
14    A3    67
15    A3    68
16    A3    69
17    A3    70
18    A4    58
19    A4    62
20    A4    60
21    A4    59
22    A4    61
23    A4    63
24    A4    64

In [3]:
data2 = [
    {"class": "A1", "time": 62},
    {"class": "A1", "time": 60},
    {"class": "A1", "time": 61},
]

df2 =DataFrame(data2)
df2

  class  time
0    A1    62
1    A1    60
2    A1    61

In [4]:
new_df = df.astype({'class': 'category'})
new_df

   class  time
0     A1    62
1     A1    60
2     A1    63
3     A1    59
4     A1    61
5     A2    62
6     A2    67
7     A2    71
8     A2    64
9     A2    65
10    A2    66
11    A3    68
12    A3    66
13    A3    71
14    A3    67
15    A3    68
16    A3    69
17    A3    70
18    A4    58
19    A4    62
20    A4    60
21    A4    59
22    A4    61
23    A4    63
24    A4    64